# VelocityPressure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentData..::..VelocityPressure Property
MEPNetworkSegmentData Class See Also
---
The calculated velocity pressure of this segment, in kg/(ft*s^2).
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double VelocityPressure { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VelocityPressure As Double
	Get
```

Visual C++
---
```text
public:
property double VelocityPressure {
	double get ();
}
```

# See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace